programming/course/chef_fundamentals.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: Chef Fundamentals

* Welcome to Chef Fundamentals
** Install ChefDK

Download ChefDK at [[https://downloads.chef.io/chefdk][Chef Downloads]] and install on local machine. Confirm installation by:

#+begin_src sh
chef --version
#+end_src

** Configure Lab Environment with Vagrant and Virtualbox

Confirm Vagrant and Virtualbox are installed:

#+begin_src sh
vboxmanage --version
vagrant --version
#+end_src

Create a Vagrant box and SSH into it:

#+begin_src sh
vagrant box add bento/centos-7.2 --provider=virtualbox
vagrant init bento/centos-7.2 # Vagrantfile is created
vagrant up
vagrant ssh
#+end_src

Install ChefDK in Vagrant box:

#+begin_src sh
curl https://omnitruck.chef.io/install.sh | sudo bash -s -- -P chefdk -c stable -v 3.10.1
chef --version
#+end_src
** Configure Lab Environment with AWS

Launch an EC2 instance:

- AMI: CentOS 7
- Security groups: Enable HTTP/HTTPS ports
- Key pairs: Create key pair =centos7= and download the private key file =centos7.pem=

Connect to the instance via SSH:

#+begin_src sh
chmod 400 centos7.pem
ssh -i centos7.pem centos@ec2-3-84-192-46.compute-1.amazonaws.com
#+end_src

Install ChefDK on the instance:

#+begin_src sh
curl https://omnitruck.chef.io/install.sh | sudo bash -s -- -P chefdk -c stable -v 3.10.1
chef --version
#+end_src

** Configure Lab Environment with GCP

1. Create a project on GCP.
2. Go to [[https://console.cloud.google.com/compute/instances][GCP | Compute Engine | VM Instances]] and create an instance:
   - Boot disk: CentOS 7
   - Firewall: Allow HTTP/HTTPS traffic
   - SSH keys: Paste the public key of the key pair to use for SSH connection (=ssh-gen= a new key pair if necessary)

Connect to the instance via GCP browser SSH or SSH client:

#+begin_src sh
ssh -i <private_key> <user>@<external_ip>
#+end_src

Install ChefDK on the instance:

#+begin_src sh
curl https://omnitruck.chef.io/install.sh | sudo bash -s -- -P chefdk -c stable -v 3.10.1
chef --version
#+end_src
* Chef and Configuration Management
** First Chef Recipe

Create a simple recipe:

#+CAPTION: =hello.rb=
#+begin_src ruby
file '/hello.txt' do # Create a file
  content 'Hello, world!' # Specify content of the file
end
#+end_src

Apply the recipe to current node:

#+begin_src sh
sudo chef-client --local-mode hello.rb
#+end_src

* Resources
** Create a Workstation Setup Recipe

Create a recipe to install 2 services and 1 file:

#+CAPTION: =setup.rb=
#+begin_src ruby
package 'tree' do
  action :install
end

package 'ntp' do
  action :install
end

service 'ntpd' do
  action [ :enable, :start ]
end

file '/etc/motd' do
  action :create
  content 'This is the property of ...'
  owner 'root'
  group 'root'
end
#+end_src

* Cookbooks
