programming/course/chef_fundamentals.html
---
title: "Chef Fundamentals"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-16 Sun 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chef Fundamentals</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Chef Fundamentals</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7d01cdb">1 Welcome to Chef Fundamentals</a>
<ul>
<li><a href="#org14acedc">1.1 Install ChefDK</a></li>
<li><a href="#org20f657a">1.2 Configure Lab Environment with Vagrant and Virtualbox</a></li>
<li><a href="#orgdbd5f3e">1.3 Configure Lab Environment with AWS</a></li>
<li><a href="#orgb5c9d3e">1.4 Configure Lab Environment with GCP</a></li>
</ul>
</li>
<li><a href="#orga3ff73e">2 Chef and Configuration Management</a>
<ul>
<li><a href="#orgea5b0d9">2.1 First Chef Recipe</a></li>
</ul>
</li>
<li><a href="#org7f529da">3 Resources</a>
<ul>
<li><a href="#org5cbe802">3.1 Create a Workstation Setup Recipe</a></li>
</ul>
</li>
<li><a href="#orgcdf74f1">4 Cookbooks</a>
<ul>
<li><a href="#org38ed508">4.1 Deploy an Apache Web Server</a></li>
</ul>
</li>
<li><a href="#org3389b50">5 Chef Client</a>
<ul>
<li><a href="#org44c4351">5.1 Apply Recipes and Cookbooks</a></li>
<li><a href="#org89a2430">5.2 The include_recipe Method</a></li>
</ul>
</li>
<li><a href="#org8a406aa">6 Ohai</a>
<ul>
<li><a href="#org556cb7c">6.1 An Object Called "Node"</a></li>
<li><a href="#org90e06d5">6.2 Access Node Attributes</a></li>
</ul>
</li>
<li><a href="#orgd3616ba">7 Templates</a>
<ul>
<li><a href="#orgbadd189">7.1 Understand Embedded Ruby</a></li>
</ul>
</li>
<li><a href="#orgf1f927e">8 Other Common Resources</a>
<ul>
<li><a href="#org90999de">8.1 cookbook_file</a></li>
<li><a href="#org8abe43b">8.2 remote_file</a></li>
<li><a href="#org99da2c4">8.3 execute</a></li>
<li><a href="#orgb6684cd">8.4 user and group</a></li>
<li><a href="#org86d40e3">8.5 Send and Receive Notifications</a></li>
</ul>
</li>
<li><a href="#org55df4a9">9 Troubleshooting and Bonus Content</a>
<ul>
<li><a href="#org1dbf467">9.1 Explore the ChefDK</a></li>
<li><a href="#orgab1cc07">9.2 Chef Toolkit</a></li>
<li><a href="#orgbbad438">9.3 Intro to Test Kitchen</a></li>
<li><a href="#orgec29670">9.4 Intro to ChefSpec</a></li>
</ul>
</li>
<li><a href="#org405c3ed">10 Chef Server</a>
<ul>
<li><a href="#orgc480bfb">10.1 Why Use A Chef Server?</a></li>
<li><a href="#org2efcea7">10.2 Get Started with Hosted Chef</a></li>
<li><a href="#org168ec7f">10.3 Upload Cookbooks</a></li>
<li><a href="#orgabd45e4">10.4 Reconfigure Vagrant Environment</a></li>
<li><a href="#org9b2fc83">10.5 Bootstrap Web Server</a></li>
</ul>
</li>
<li><a href="#org4ca4e15">11 Community Cookbooks</a>
<ul>
<li><a href="#org60c6b21">11.1 Explore the Supermarket</a></li>
<li><a href="#org0c4f026">11.2 Create a Wrapper Cookbook</a></li>
<li><a href="#org6557567">11.3 Add Web Server Members</a></li>
<li><a href="#org7644e3e">11.4 Manage Cookbooks with Berkshelf</a></li>
<li><a href="#org0a364e9">11.5 Bootstrap Load Balancer</a></li>
</ul>
</li>
<li><a href="#orgc732050">12 Manage Nodes</a>
<ul>
<li><a href="#org57dd0e0">12.1 Run chef-client on a Schedule</a></li>
</ul>
</li>
<li><a href="#org2b587d1">13 Roles</a>
<ul>
<li><a href="#orgdadb895">13.1 Create and Assign Roles</a></li>
<li><a href="#org74e0017">13.2 Converge Using the <code>knife ssh</code> Command</a></li>
</ul>
</li>
<li><a href="#org995d167">14 Search</a>
<ul>
<li><a href="#org5d9a0a5">14.1 Explore Chef Server Indices</a></li>
<li><a href="#orgd785c4b">14.2 Run Searches with Knife</a></li>
<li><a href="#orgdb57a47">14.3 Refactor for Dynamic Load Balancing</a></li>
</ul>
</li>
<li><a href="#orgeb976e0">15 Environments</a>
<ul>
<li><a href="#org0331aef">15.1 Create and Manage a Production Environment</a></li>
<li><a href="#org77751c4">15.2 Refine the Load Balancer</a></li>
</ul>
</li>
<li><a href="#org3d6d03c">16 Data Bags</a>
<ul>
<li><a href="#orgbffba4a">16.1 What's in the Bag?</a></li>
<li><a href="#org1f89857">16.2 Create and Manage Data Bags</a></li>
<li><a href="#org7ea1ee5">16.3 Dynamic Search and Find</a></li>
<li><a href="#org56e461f">16.4 Encrypt Secrets</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7d01cdb" class="outline-2">
<h2 id="org7d01cdb"><span class="section-number-2">1</span> Welcome to Chef Fundamentals</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org14acedc" class="outline-3">
<h3 id="org14acedc"><span class="section-number-3">1.1</span> Install ChefDK</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Download ChefDK at <a href="https://downloads.chef.io/chefdk">Chef Downloads</a> and install on local machine. Confirm installation by:
</p>

<div class="org-src-container">
<pre class="src src-sh">chef --version
</pre>
</div>
</div>
</div>

<div id="outline-container-org20f657a" class="outline-3">
<h3 id="org20f657a"><span class="section-number-3">1.2</span> Configure Lab Environment with Vagrant and Virtualbox</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Confirm Vagrant and Virtualbox are installed:
</p>

<div class="org-src-container">
<pre class="src src-sh">vboxmanage --version
vagrant --version
</pre>
</div>

<p>
Create a Vagrant box and SSH into it:
</p>

<div class="org-src-container">
<pre class="src src-sh">vagrant box add bento/centos-7.2 --provider=virtualbox
vagrant init bento/centos-7.2 <span class="org-comment-delimiter"># </span><span class="org-comment">Vagrantfile is created</span>
vagrant up
vagrant ssh
</pre>
</div>

<p>
Install ChefDK in Vagrant box:
</p>

<div class="org-src-container">
<pre class="src src-sh">curl https://omnitruck.chef.io/install.sh | sudo bash -s -- -P chefdk -c stable -v 3.10.1
chef --version
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdbd5f3e" class="outline-3">
<h3 id="orgdbd5f3e"><span class="section-number-3">1.3</span> Configure Lab Environment with AWS</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Launch an EC2 instance:
</p>

<ul class="org-ul">
<li>AMI: CentOS 7</li>
<li>Security groups: Enable HTTP/HTTPS ports</li>
<li>Key pairs: Create key pair <code>centos7</code> and download the private key file <code>centos7.pem</code></li>
</ul>

<p>
Connect to the instance via SSH:
</p>

<div class="org-src-container">
<pre class="src src-sh">chmod 400 centos7.pem
ssh -i centos7.pem centos@ec2-3-84-192-46.compute-1.amazonaws.com
</pre>
</div>

<p>
Install ChefDK on the instance:
</p>

<div class="org-src-container">
<pre class="src src-sh">curl https://omnitruck.chef.io/install.sh | sudo bash -s -- -P chefdk -c stable -v 3.10.1
chef --version
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5c9d3e" class="outline-3">
<h3 id="orgb5c9d3e"><span class="section-number-3">1.4</span> Configure Lab Environment with GCP</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Create a project on GCP.</li>
<li>Go to <a href="https://console.cloud.google.com/compute/instances">GCP | Compute Engine | VM Instances</a> and create an instance:
<ul class="org-ul">
<li>Boot disk: CentOS 7</li>
<li>Firewall: Allow HTTP/HTTPS traffic</li>
<li>SSH keys: Paste the public key of the key pair to use for SSH connection (<code>ssh-gen</code> a new key pair if necessary)</li>
</ul></li>
</ol>

<p>
Connect to the instance via GCP browser SSH or SSH client:
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh -i &lt;private_key&gt; &lt;user&gt;@&lt;external_ip&gt;
</pre>
</div>

<p>
Install ChefDK on the instance:
</p>

<div class="org-src-container">
<pre class="src src-sh">curl https://omnitruck.chef.io/install.sh | sudo bash -s -- -P chefdk -c stable -v 3.10.1
chef --version
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga3ff73e" class="outline-2">
<h2 id="orga3ff73e"><span class="section-number-2">2</span> Chef and Configuration Management</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgea5b0d9" class="outline-3">
<h3 id="orgea5b0d9"><span class="section-number-3">2.1</span> First Chef Recipe</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Create a simple recipe:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span><code>hello.rb</code></label><pre class="src src-ruby">file <span class="org-string">'/hello.txt'</span> <span class="org-keyword">do</span> <span class="org-comment-delimiter"># </span><span class="org-comment">Create a file</span>
  content <span class="org-string">'Hello, world!'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">Specify content of the file</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Apply the recipe to current node:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo chef-client --local-mode hello.rb
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7f529da" class="outline-2">
<h2 id="org7f529da"><span class="section-number-2">3</span> Resources</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org5cbe802" class="outline-3">
<h3 id="org5cbe802"><span class="section-number-3">3.1</span> Create a Workstation Setup Recipe</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Create a recipe to install 2 services and 1 file:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span><code>setup.rb</code></label><pre class="src src-ruby">package <span class="org-string">'tree'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:install</span>
<span class="org-keyword">end</span>

package <span class="org-string">'ntp'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:install</span>
<span class="org-keyword">end</span>

service <span class="org-string">'ntpd'</span> <span class="org-keyword">do</span>
  action [ <span class="org-constant">:enable</span>, <span class="org-constant">:start</span> ]
<span class="org-keyword">end</span>

file <span class="org-string">'/etc/motd'</span> <span class="org-keyword">do</span>
  action <span class="org-constant">:create</span>
  content <span class="org-string">'This is the property of ...'</span>
  owner <span class="org-string">'root'</span>
  group <span class="org-string">'root'</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>
</div>
