programming/course/chef_fundamentals.org
** user and group

Create a user and a group, and assign the user to the group:

#+CAPTION: =cookbooks/workstation/recipes/setup.rb=
#+begin_src ruby
user 'user1' do
  home '/home/user1'
  shell '/bin/bash'
end

group 'admins' do
  members ['user1']
  append true
end
#+end_src

** Send and Receive Notifications

2 ways to restart =httpd= when a =template= resource is updated:

#+CAPTION: =cookbooks/apache/recipes/server.rb=
#+begin_src ruby
template '/var/www/html/index.html' do
  source 'index.html.erb'
  notifies :restart, 'service[httpd]', :immediately
end

service 'httpd' do
  action [:enable, :start]
end
#+end_src

#+CAPTION: =cookbooks/apache/recipes/server.rb=
#+begin_src ruby
template '/var/www/html/index.html' do
  source 'index.html.erb'
end

service 'httpd' do
  action [:enable, :start]
  subscribes :restart, 'template[/var/www/html/index.html]', :immediately
end
#+end_src
* Troubleshooting and Bonus Content
** Explore the ChefDK

When Chef is installed, an embedded Ruby is installed with it, which is separate from the local globally installed Ruby:

#+begin_src sh
$ ruby -v
-bash: ruby: command not found # Ruby is not installed globally
$ chef exec ruby -v
ruby 2.5.5p157 ... # Ruby is installed in embedded context
#+end_src

Check Ruby syntax of Chef recipes:

#+begin_src sh
chef exec ruby -c cookbooks/*/recipes/*.rb
#+end_src

** Chef Toolkit

If a Chef tool is not available directly (because the include path is not configured), try using it with the embedded context:

#+begin_src sh
$ rspec -v
-bash: rspec: command not found
$ chef exec rspec -v
RSpec 3.8
#+end_src

** Intro to Test Kitchen

Update the Test Kitchen config file:

#+CAPTION: =cookbooks/apache/.kitchen.yml=
#+begin_src yaml
provisioner:
  name: chef_zero
  always_update_cookbooks: true
  # Add these 2 lines:
  client_rb:
    chef_license: accept
#+end_src

Write integration tests by following [[https://www.inspec.io/docs/reference/resources/][InSpec Resources Reference]]:

#+CAPTION: =cookbooks/apache/test/integration/default/server_test.rd=
#+begin_src ruby
describe port(80) do
  it { should be_listening }
end

describe command('curl localhost') do
  its(:stdout) { should match(/Hello, world!/) }
end
#+end_src

Run tests with Test Kitchen from local environment (not from within the Vagrant):

#+begin_src sh
$ cd cookbooks/apache
$ kitchen create
$ kitchen list # Confirm instance is created
Instance             Driver   Provisioner  Verifier  Transport  Last Action  Last Error
default-ubuntu-1604  Vagrant  ChefZero     Inspec    Ssh        Created      <None>
$ kitchen login # Connect to instance
> curl localhost # Confirm httpd is not running
curl: (7) Failed connect to localhost:80; Connection refused
> exit
$ kitchen converge # Install Chef on the instance and converge (apply the recipes)
$ kitchen login
> curl localhost # Confirm httpd is running
<html>...
> exit
$ kitchen verify # Run integration tests
Test Summary: 2 successful, 0 failures, 0 skipped
#+end_src

** Intro to ChefSpec

Running integration tests with InSpec needs external dependencies (driver etc.) and is slow. Running unit tests with ChefSpec is simpler and faster.

Write unit test:

#+CAPTION: =cookbooks/apache/spec/unit/recipes/server_spec.rb=
#+begin_src ruby
require 'spec_helper'

describe 'apache::server' do
  context 'When all attributes are default, on an unspecified platform' do
    let(:chef_run) do
      runner = ChefSpec::ServerRunner.new
      runner.converge(described_recipe)
    end

    it 'installs the correct package' do
      expect(chef_run).to install_package('httpd')
    end

    it 'creates an default html file' do
      expect(chef_run).to create_template('/var/www/html/index.html')
    end

    it 'enables the service' do
      expect(chef_run).to enable_service('httpd')
    end

    it 'starts the service' do
      expect(chef_run).to start_service('httpd')
    end
  end
end
#+end_src

Add unit test coverage:

#+CAPTION: =cookbooks/apache/spec/spec_helper.rb=
#+begin_src ruby
ChefSpec::Coverage.start!
#+end_src

Run unit test:

#+begin_src sh
$ cd cookbooks/apache
$ chef exec rspec spec/unit/recipes/server_spec.rb
4 examples, 0 failures
#+end_src
* Chef Server
** Why Use A Chef Server?

Without using Chef Server, provisioning multiple nodes will be:

1. Install Chef tools on each node.
2. Pull cookbooks onto the node, via Git or SCP.
3. Run Chef Client in local mode to apply the recipes.

