programming/course/chef_fundamentals.html

<div id="outline-container-orgb6684cd" class="outline-3">
<h3 id="orgb6684cd"><span class="section-number-3">8.4</span> user and group</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Create a user and a group, and assign the user to the group:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 12: </span><code>cookbooks/workstation/recipes/setup.rb</code></label><pre class="src src-ruby">user <span class="org-string">'user1'</span> <span class="org-keyword">do</span>
  home <span class="org-string">'/home/user1'</span>
  shell <span class="org-string">'/bin/bash'</span>
<span class="org-keyword">end</span>

group <span class="org-string">'admins'</span> <span class="org-keyword">do</span>
  members [<span class="org-string">'user1'</span>]
  append <span class="org-constant">true</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org86d40e3" class="outline-3">
<h3 id="org86d40e3"><span class="section-number-3">8.5</span> Send and Receive Notifications</h3>
<div class="outline-text-3" id="text-8-5">
<p>
2 ways to restart <code>httpd</code> when a <code>template</code> resource is updated:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 13: </span><code>cookbooks/apache/recipes/server.rb</code></label><pre class="src src-ruby">template <span class="org-string">'/var/www/html/index.html'</span> <span class="org-keyword">do</span>
  source <span class="org-string">'index.html.erb'</span>
  notifies <span class="org-constant">:restart</span>, <span class="org-string">'service[httpd]'</span>, <span class="org-constant">:immediately</span>
<span class="org-keyword">end</span>

service <span class="org-string">'httpd'</span> <span class="org-keyword">do</span>
  action [<span class="org-constant">:enable</span>, <span class="org-constant">:start</span>]
<span class="org-keyword">end</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 14: </span><code>cookbooks/apache/recipes/server.rb</code></label><pre class="src src-ruby">template <span class="org-string">'/var/www/html/index.html'</span> <span class="org-keyword">do</span>
  source <span class="org-string">'index.html.erb'</span>
<span class="org-keyword">end</span>

service <span class="org-string">'httpd'</span> <span class="org-keyword">do</span>
  action [<span class="org-constant">:enable</span>, <span class="org-constant">:start</span>]
  subscribes <span class="org-constant">:restart</span>, <span class="org-string">'template[/var/www/html/index.html]'</span>, <span class="org-constant">:immediately</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org55df4a9" class="outline-2">
<h2 id="org55df4a9"><span class="section-number-2">9</span> Troubleshooting and Bonus Content</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-org1dbf467" class="outline-3">
<h3 id="org1dbf467"><span class="section-number-3">9.1</span> Explore the ChefDK</h3>
<div class="outline-text-3" id="text-9-1">
<p>
When Chef is installed, an embedded Ruby is installed with it, which is separate from the local globally installed Ruby:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ ruby -v
-bash: ruby: command not found <span class="org-comment-delimiter"># </span><span class="org-comment">Ruby is not installed globally</span>
$ chef exec ruby -v
ruby 2.5.5p157 ... <span class="org-comment-delimiter"># </span><span class="org-comment">Ruby is installed in embedded context</span>
</pre>
</div>

<p>
Check Ruby syntax of Chef recipes:
</p>

<div class="org-src-container">
<pre class="src src-sh">chef exec ruby -c cookbooks/*/recipes/*.rb
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab1cc07" class="outline-3">
<h3 id="orgab1cc07"><span class="section-number-3">9.2</span> Chef Toolkit</h3>
<div class="outline-text-3" id="text-9-2">
<p>
If a Chef tool is not available directly (because the include path is not configured), try using it with the embedded context:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ rspec -v
-bash: rspec: command not found
$ chef exec rspec -v
RSpec 3.8
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbad438" class="outline-3">
<h3 id="orgbbad438"><span class="section-number-3">9.3</span> Intro to Test Kitchen</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Update the Test Kitchen config file:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 15: </span><code>cookbooks/apache/.kitchen.yml</code></label><pre class="src src-yaml"><span class="org-variable-name">provisioner</span>:
  <span class="org-variable-name">name</span>: chef_zero
  <span class="org-variable-name">always_update_cookbooks</span>: <span class="org-constant">true</span>
  <span class="org-comment-delimiter"># </span><span class="org-comment">Add these 2 lines:</span>
  <span class="org-variable-name">client_rb</span>:
<span class="org-yaml-tab">    </span><span class="org-variable-name">chef_license</span>: accept
</pre>
</div>

<p>
Write integration tests by following <a href="https://www.inspec.io/docs/reference/resources/">InSpec Resources Reference</a>:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 16: </span><code>cookbooks/apache/test/integration/default/server_test.rd</code></label><pre class="src src-ruby">describe port(80) <span class="org-keyword">do</span>
  it { should be_listening }
<span class="org-keyword">end</span>

describe command(<span class="org-string">'curl localhost'</span>) <span class="org-keyword">do</span>
  its(<span class="org-constant">:stdout</span>) { should match(<span class="org-string">/Hello, world!/</span>) }
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Run tests with Test Kitchen from local environment (not from within the Vagrant):
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cd cookbooks/apache
$ kitchen create
$ kitchen list <span class="org-comment-delimiter"># </span><span class="org-comment">Confirm instance is created</span>
Instance             Driver   Provisioner  Verifier  Transport  Last Action  Last Error
default-ubuntu-1604  Vagrant  ChefZero     Inspec    Ssh        Created      &lt;None&gt;
$ kitchen login <span class="org-comment-delimiter"># </span><span class="org-comment">Connect to instance</span>
&gt; curl localhost <span class="org-comment-delimiter"># </span><span class="org-comment">Confirm httpd is not running</span>
curl: (7) Failed connect to localhost:80; Connection refused
&gt; exit
$ kitchen converge <span class="org-comment-delimiter"># </span><span class="org-comment">Install Chef on the instance and converge (apply the recipes)</span>
$ kitchen login
&gt; curl localhost <span class="org-comment-delimiter"># </span><span class="org-comment">Confirm httpd is running</span>
&lt;html&gt;...
&gt; exit
$ kitchen verify <span class="org-comment-delimiter"># </span><span class="org-comment">Run integration tests</span>
Test Summary: 2 successful, 0 failures, 0 skipped
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec29670" class="outline-3">
<h3 id="orgec29670"><span class="section-number-3">9.4</span> Intro to ChefSpec</h3>
<div class="outline-text-3" id="text-9-4">
<p>
Running integration tests with InSpec needs external dependencies (driver etc.) and is slow. Running unit tests with ChefSpec is simpler and faster.
</p>

<p>
Write unit test:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 17: </span><code>cookbooks/apache/spec/unit/recipes/server_spec.rb</code></label><pre class="src src-ruby"><span class="org-builtin">require</span> <span class="org-string">'spec_helper'</span>

describe <span class="org-string">'apache::server'</span> <span class="org-keyword">do</span>
  context <span class="org-string">'When all attributes are default, on an unspecified platform'</span> <span class="org-keyword">do</span>
    let(<span class="org-constant">:chef_run</span>) <span class="org-keyword">do</span>
      runner = <span class="org-type">ChefSpec</span>::<span class="org-type">ServerRunner</span>.new
      runner.converge(described_recipe)
    <span class="org-keyword">end</span>

    it <span class="org-string">'installs the correct package'</span> <span class="org-keyword">do</span>
      expect(chef_run).to install_package(<span class="org-string">'httpd'</span>)
    <span class="org-keyword">end</span>

    it <span class="org-string">'creates an default html file'</span> <span class="org-keyword">do</span>
      expect(chef_run).to create_template(<span class="org-string">'/var/www/html/index.html'</span>)
    <span class="org-keyword">end</span>

    it <span class="org-string">'enables the service'</span> <span class="org-keyword">do</span>
      expect(chef_run).to enable_service(<span class="org-string">'httpd'</span>)
    <span class="org-keyword">end</span>

    it <span class="org-string">'starts the service'</span> <span class="org-keyword">do</span>
      expect(chef_run).to start_service(<span class="org-string">'httpd'</span>)
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Add unit test coverage:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 18: </span><code>cookbooks/apache/spec/spec_helper.rb</code></label><pre class="src src-ruby"><span class="org-type">ChefSpec</span>::<span class="org-type">Coverage</span>.start!
</pre>
</div>

<p>
Run unit test:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cd cookbooks/apache
$ chef exec rspec spec/unit/recipes/server_spec.rb
4 examples, 0 failures
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org405c3ed" class="outline-2">
<h2 id="org405c3ed"><span class="section-number-2">10</span> Chef Server</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgc480bfb" class="outline-3">
<h3 id="orgc480bfb"><span class="section-number-3">10.1</span> Why Use A Chef Server?</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Without using Chef Server, provisioning multiple nodes will be:
</p>

<ol class="org-ol">
<li>Install Chef tools on each node.</li>
<li>Pull cookbooks onto the node, via Git or SCP.</li>
<li>Run Chef Client in local mode to apply the recipes.</li>
</ol>
</div>
</div>
