programming/course/chef_fundamentals.html

<div id="outline-container-org2efcea7" class="outline-3">
<h3 id="org2efcea7"><span class="section-number-3">10.2</span> Get Started with Hosted Chef</h3>
<div class="outline-text-3" id="text-10-2">
<p>
<a href="https://manage.chef.io">Chef Manage</a> is free manager Chef Server provided by Chef.
</p>

<ol class="org-ol">
<li>Sign up to Chef Manage.</li>
<li>Create an organization.</li>
<li>Select the organization, go to Starter Kit, and click Download Starter Kit.</li>
<li>Move the <code>chef-repo</code> directory to a proper location.</li>
<li>Replace the <code>chef-repo/cookbooks</code> directory with the <code>cookbooks</code> directory to use.</li>
</ol>

<p>
NOTE: There is a special recipe to include into the <code>workstation</code> cookbook:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 19: </span><code>chef-repo/cookbooks/workstation/recipes/vagrant.rb</code></label><pre class="src src-ruby"><span class="org-comment-delimiter"># </span><span class="org-comment">if you found this recipe you're probably wondering what it's for!</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">we do not cover ohai plugins in this class, but it's the process of modifying</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the information added to the node object at the beginning of a chef-client run.</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">the vagrant-ohai plugin modifes the node['ipaddress'] attribute gathered by ohai</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">to match what we define in the Vagrant file. Otherwise ohai will detect the internal</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ipaddress assigned by vagrant. This allows our load balancer to work with the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">virtual instances we manage later in the class.</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@see https://github.com/avishai-ish-shalom/vagrant-ohai</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@see https://docs.chef.io/ohai_custom.html</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">execute sudo /etc/init.d/network restart to reload the networking interfaces</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">this problem seems confined to Vagrant 1.9.1</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">see vagrant issue https://github.com/mitchellh/vagrant/issues/8115</span>
execute <span class="org-string">'reload network interfaces'</span> <span class="org-keyword">do</span>
  command <span class="org-string">'sudo /etc/init.d/network restart'</span>
  not_if <span class="org-string">"ifconfig | grep 'eth0'"</span>
<span class="org-keyword">end</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">set plugin path for ohai if not already defined in /etc/chef/client.rb</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">this is always set on a subsequent chef-client run because of ruby_block[configure ohai plugin path]</span>
<span class="org-keyword">if</span> ::<span class="org-type">Ohai</span>::<span class="org-type">Config</span>.ohai.nil?
  ::<span class="org-type">Ohai</span>::<span class="org-type">Config</span>[<span class="org-string">'plugin_path'</span>] &lt;&lt; <span class="org-string">'/etc/chef/ohai_plugins'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">old format</span>
<span class="org-keyword">else</span>
  ::<span class="org-type">Ohai</span>::<span class="org-type">Config</span>.ohai[<span class="org-string">'plugin_path'</span>] &lt;&lt; <span class="org-string">'/etc/chef/ohai_plugins'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">new format</span>
<span class="org-keyword">end</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">add vagrant-ohai plugin to the resource collection</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@see https://docs.chef.io/resource_ohai.html</span>
ohai <span class="org-string">'vagrant-ipaddress'</span> <span class="org-keyword">do</span>
  plugin <span class="org-string">'ipaddress'</span>
  action <span class="org-constant">:nothing</span>
<span class="org-keyword">end</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">modify the client.rb file to include the plugin path for the vagrant-ohai plugin</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">At the beginning of every chef-client run, the client.rb file is loaded. </span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@see https://docs.chef.io/config_rb_client.html</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">This ruby_block resource modifies the client.rb to include the '/etc/chef/ohai_plugins'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">directory, with a guard to check if the file has already been modified.</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@see https://docs.chef.io/resource_common.html#guards</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">When the client.rb file is modified, the notification adds 'ohai[vagrant-ohai]' to the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">resource collection, re-running ohai with the new plugin loaded. This ensures we have</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">access to the node['ipaddress'] attribute during this chef-client run.</span>
ruby_block <span class="org-string">"configure ohai plugin path"</span> <span class="org-keyword">do</span>
  block <span class="org-keyword">do</span>
    file = <span class="org-type">Chef</span>::<span class="org-type">Util</span>::<span class="org-type">FileEdit</span>.new(<span class="org-string">"/etc/chef/client.rb"</span>)
    file.insert_line_if_no_match(<span class="org-string">"ohai.plugin_path &lt;&lt; '/etc/chef/ohai_plugins'"</span>,<span class="org-string">"ohai.plugin_path &lt;&lt; '/etc/chef/ohai_plugins'"</span>)
    file.write_file
  <span class="org-keyword">end</span>
  notifies <span class="org-constant">:reload</span>, <span class="org-string">'ohai[vagrant-ipaddress]'</span>, <span class="org-constant">:immediately</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org168ec7f" class="outline-3">
<h3 id="org168ec7f"><span class="section-number-3">10.3</span> Upload Cookbooks</h3>
<div class="outline-text-3" id="text-10-3">
<p>
<code>chef-repo/.chef/</code> directory contains the info needed to communicate with Chef Manage:
</p>

<div class="org-src-container">
<pre class="src src-sh">chef-repo/.chef/
  knife.rb   <span class="org-comment-delimiter"># </span><span class="org-comment">Server URL, cookbook path etc.</span>
  &lt;user&gt;.pem <span class="org-comment-delimiter"># </span><span class="org-comment">Auth credential</span>
</pre>
</div>

<p>
Confirm the local repo can communicate with Chef Manager:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cd chef-repo
$ knife client list
&lt;org&gt;-validator
</pre>
</div>

<p>
Upload cookbooks to Chef Server and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cd chef-repo
$ knife cookbook upload workstation apache <span class="org-comment-delimiter"># </span><span class="org-comment">Don't need to specify the "cookbooks/" directory</span>
Uploaded 2 cookbooks.
$ knife cookbook list
apache        0.1.0
workstation   0.1.0
</pre>
</div>

<p>
Go to <a href="https://api.chef.io">Chef Manage</a> and confirm the cookbooks show up under Policy tab.
</p>
</div>
</div>
