programming/course/chef_fundamentals.org
** Reconfigure Vagrant Environment

Start 3 Vagrant nodes of 2 web servers and 1 load balancer with config:

#+CAPTION: =chef-repo/Vagrantfile=
#+begin_src ruby
unless Vagrant.has_plugin?("vagrant-ohai")
  raise "vagrant-ohai plugin is not installed! Install with 'vagrant plugin install vagrant-ohai'"
end

NODE_SCRIPT = <<EOF.freeze
  echo "Preparing node..."
  # ensure the time is up to date
  yum -y install ntp
  systemctl start ntpd
  systemctl enable ntpd
  curl -L https://omnitruck.chef.io/install.sh | sudo bash -s -- -v 14
EOF

def set_hostname(server)
  server.vm.provision 'shell', inline: "hostname #{server.vm.hostname}"
end

Vagrant.configure(2) do |config|

  config.vm.define 'web1' do |n|
    n.vm.box = 'bento/centos-7.2'
    n.vm.box_version = '2.2.9'
    n.vm.hostname = 'web1'
    n.vm.network :private_network, ip: '192.168.10.43', nic_type: "virtio"
    n.vm.provision :shell, inline: NODE_SCRIPT.dup
    set_hostname(n)
  end

  config.vm.define 'web2' do |n|
    n.vm.box = 'bento/centos-7.2'
    n.vm.box_version = '2.2.9'
    n.vm.hostname = 'web2'
    n.vm.network :private_network, ip: '192.168.10.44', nic_type: "virtio"
    n.vm.provision :shell, inline: NODE_SCRIPT.dup
    set_hostname(n)
  end

  config.vm.define 'load-balancer' do |n|
    n.vm.box = 'bento/centos-7.2'
    n.vm.box_version = '2.2.9'
    n.vm.hostname = 'load-balancer'
    n.vm.network "forwarded_port", guest: 80, host: 9000
    n.vm.provision :shell, inline: NODE_SCRIPT.dup
    set_hostname(n)
  end

end
#+end_src

** Bootstrap Web Server

The bootstraping process of a node includes:

- Installs Chef Client, if not already installed.
- Provides credentials and details of how to communicate with Chef Server.
- Runs Ohai.
- Converges the node.
- Saves the node object to Chef Server.

Get SSH config of the Vagrant nodes:

#+begin_src sh
$ vagrant ssh-config
Host web1
  User vagrant
  Port <port> # To be used in "knife bootstrap" command
  IdentityFile <path_to_id_file> # To be used in "knife bootstrap" command
#+end_src

Bootstrap the node with SSH config and confirm the result:

#+begin_src sh
$ knife bootstrap localhost \ # Because the Vagrant nodes are local
                              # Will be FQDN or public IP if using cloud provider
-N web1 -p <port> -x vagrant -i <path_to_id_file> --sudo
127.0.0.1 -----> Existing Chef installation detected # Will install Chef Client if not installed
127.0.0.1 Starting Chef Client, version 14.12.9
127.0.0.1 resolving cookbooks for run list: [] # There is empty run list
127.0.0.1 Converging 0 resources
$ knife node list
$ knife node show web1
#+end_src

Add to the node's run list and confirm the result:

#+begin_src sh
$ knife node run_list add web1 "recipe[workstation],recipe[apache]"
$ knife node show web1
Run List: recipe[workstation], recipe[apache]
#+end_src

Login to the Vagrant node and run Chef Client:

#+begin_src sh
$ vagrant ssh web1
> sudo chef-client # Don't need additional info, will connect to Chef Server, pull and run recipes
#+end_src

* Community Cookbooks
** Explore the Supermarket

[[https://supermarket.chef.io][Chef Supermarket]] is where the community share Chef cookbooks. There are basically 2 kinds of cookbooks:

- Cookbooks of recipes.
- Cookbooks of custom resources, e.g. [[https://supermarket.chef.io/cookbooks/haproxy][haproxy]]

Cookbooks that provide custom resources can be used as libraries by other cookbooks.

** Create a Wrapper Cookbook

A "wrapper cookbook" references other cookbooks as libraries, and use them with custom attributes.

Generate a new cookbook:

#+begin_src sh
cd chef-repo/cookbooks
chef generate cookbook myhaproxy
#+end_src

Add =haproxy= cookbook as dependency:

#+CAPTION: =chef-repo/cookbooks/myhaproxy/metadata.rb=
#+begin_src ruby
depends 'haproxy', '~> 7.1.0'
#+end_src

=haproxy= provides [[https://github.com/sous-chefs/haproxy/tree/master/test/fixtures/cookbooks/test/recipes][example recipes]] to get started with. Copy the recipe =config_array.rb= to the cookbook (but remove the unneeded parts):

#+CAPTION: =chef-repo/cookbooks/myhaproxy/recipes/default.rb=
#+begin_src ruby
haproxy_install 'package'

haproxy_frontend 'http-in' do
  bind '*:80'
  default_backend 'servers'
end

haproxy_backend 'servers' do
  server [
    'server1 127.0.0.1:8000 maxconn 32' # IP and port will be updated later
  ]
end

haproxy_service 'haproxy' do
  # Whenever haproxy_backend is updated, e.g. adding a new node, we need to
  # reload haproxy service. Subscribe to the template resouce that
  # haproxy_backend uses and reload whenever it's updated.
  subscribes :reload, 'template[/etc/haproxy/haproxy.cfg]', :immediately
end
#+end_src

