programming/course/chef_fundamentals.html

<div id="outline-container-orgabd45e4" class="outline-3">
<h3 id="orgabd45e4"><span class="section-number-3">10.4</span> Reconfigure Vagrant Environment</h3>
<div class="outline-text-3" id="text-10-4">
<p>
Start 3 Vagrant nodes of 2 web servers and 1 load balancer with config:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 20: </span><code>chef-repo/Vagrantfile</code></label><pre class="src src-ruby"><span class="org-keyword">unless</span> <span class="org-type">Vagrant</span>.has_plugin?(<span class="org-string">"vagrant-ohai"</span>)
  <span class="org-builtin">raise</span> <span class="org-string">"vagrant-ohai plugin is not installed! Install with 'vagrant plugin install vagrant-ohai'"</span>
<span class="org-keyword">end</span>

<span class="org-type">NODE_SCRIPT</span> = <span class="org-string">&lt;&lt;EOF</span>.freeze
<span class="org-string">  echo "Preparing node..."</span>
<span class="org-string">  # ensure the time is up to date</span>
<span class="org-string">  yum -y install ntp</span>
<span class="org-string">  systemctl start ntpd</span>
<span class="org-string">  systemctl enable ntpd</span>
<span class="org-string">  curl -L https://omnitruck.chef.io/install.sh | sudo bash -s -- -v 14</span>
<span class="org-string">EOF</span>

<span class="org-keyword">def</span> <span class="org-function-name">set_hostname</span>(server)
  server.vm.provision <span class="org-string">'shell'</span>, <span class="org-constant">inline:</span> <span class="org-string">"hostname </span><span class="org-variable-name">#{server.vm.hostname}</span><span class="org-string">"</span>
<span class="org-keyword">end</span>

<span class="org-type">Vagrant</span>.configure(2) <span class="org-keyword">do</span> |config|

  config.vm.define <span class="org-string">'web1'</span> <span class="org-keyword">do</span> |n|
    n.vm.box = <span class="org-string">'bento/centos-7.2'</span>
    n.vm.box_version = <span class="org-string">'2.2.9'</span>
    n.vm.hostname = <span class="org-string">'web1'</span>
    n.vm.network <span class="org-constant">:private_network</span>, <span class="org-constant">ip:</span> <span class="org-string">'192.168.10.43'</span>, <span class="org-constant">nic_type:</span> <span class="org-string">"virtio"</span>
    n.vm.provision <span class="org-constant">:shell</span>, <span class="org-constant">inline:</span> <span class="org-type">NODE_SCRIPT</span>.dup
    set_hostname(n)
  <span class="org-keyword">end</span>

  config.vm.define <span class="org-string">'web2'</span> <span class="org-keyword">do</span> |n|
    n.vm.box = <span class="org-string">'bento/centos-7.2'</span>
    n.vm.box_version = <span class="org-string">'2.2.9'</span>
    n.vm.hostname = <span class="org-string">'web2'</span>
    n.vm.network <span class="org-constant">:private_network</span>, <span class="org-constant">ip:</span> <span class="org-string">'192.168.10.44'</span>, <span class="org-constant">nic_type:</span> <span class="org-string">"virtio"</span>
    n.vm.provision <span class="org-constant">:shell</span>, <span class="org-constant">inline:</span> <span class="org-type">NODE_SCRIPT</span>.dup
    set_hostname(n)
  <span class="org-keyword">end</span>

  config.vm.define <span class="org-string">'load-balancer'</span> <span class="org-keyword">do</span> |n|
    n.vm.box = <span class="org-string">'bento/centos-7.2'</span>
    n.vm.box_version = <span class="org-string">'2.2.9'</span>
    n.vm.hostname = <span class="org-string">'load-balancer'</span>
    n.vm.network <span class="org-string">"forwarded_port"</span>, <span class="org-constant">guest:</span> 80, <span class="org-constant">host:</span> 9000
    n.vm.provision <span class="org-constant">:shell</span>, <span class="org-constant">inline:</span> <span class="org-type">NODE_SCRIPT</span>.dup
    set_hostname(n)
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b2fc83" class="outline-3">
<h3 id="org9b2fc83"><span class="section-number-3">10.5</span> Bootstrap Web Server</h3>
<div class="outline-text-3" id="text-10-5">
<p>
The bootstraping process of a node includes:
</p>

<ul class="org-ul">
<li>Installs Chef Client, if not already installed.</li>
<li>Provides credentials and details of how to communicate with Chef Server.</li>
<li>Runs Ohai.</li>
<li>Converges the node.</li>
<li>Saves the node object to Chef Server.</li>
</ul>

<p>
Get SSH config of the Vagrant nodes:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ vagrant ssh-config
Host web1
  User vagrant
  Port &lt;port&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">To be used in "knife bootstrap" command</span>
  IdentityFile &lt;path_to_id_file&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">To be used in "knife bootstrap" command</span>
</pre>
</div>

<p>
Bootstrap the node with SSH config and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife bootstrap localhost <span class="org-string">\ </span><span class="org-comment-delimiter"># </span><span class="org-comment">Because the Vagrant nodes are local</span>
                              <span class="org-comment-delimiter"># </span><span class="org-comment">Will be FQDN or public IP if using cloud provider</span>
-N web1 -p &lt;port&gt; -x vagrant -i &lt;path_to_id_file&gt; --sudo
127.0.0.1 -----&gt; Existing Chef installation detected <span class="org-comment-delimiter"># </span><span class="org-comment">Will install Chef Client if not installed</span>
127.0.0.1 Starting Chef Client, version 14.12.9
127.0.0.1 resolving cookbooks for run list: [] <span class="org-comment-delimiter"># </span><span class="org-comment">There is empty run list</span>
127.0.0.1 Converging 0 resources
$ knife node list
$ knife node show web1
</pre>
</div>

<p>
Add to the node's run list and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife node run_list add web1 <span class="org-string">"recipe[workstation],recipe[apache]"</span>
$ knife node show web1
Run List: recipe[workstation], recipe[apache]
</pre>
</div>

<p>
Login to the Vagrant node and run Chef Client:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ vagrant ssh web1
&gt; sudo chef-client <span class="org-comment-delimiter"># </span><span class="org-comment">Don't need additional info, will connect to Chef Server, pull and run recipes</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4ca4e15" class="outline-2">
<h2 id="org4ca4e15"><span class="section-number-2">11</span> Community Cookbooks</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-org60c6b21" class="outline-3">
<h3 id="org60c6b21"><span class="section-number-3">11.1</span> Explore the Supermarket</h3>
<div class="outline-text-3" id="text-11-1">
<p>
<a href="https://supermarket.chef.io">Chef Supermarket</a> is where the community share Chef cookbooks. There are basically 2 kinds of cookbooks:
</p>

<ul class="org-ul">
<li>Cookbooks of recipes.</li>
<li>Cookbooks of custom resources, e.g. <a href="https://supermarket.chef.io/cookbooks/haproxy">haproxy</a></li>
</ul>

<p>
Cookbooks that provide custom resources can be used as libraries by other cookbooks.
</p>
</div>
</div>

<div id="outline-container-org0c4f026" class="outline-3">
<h3 id="org0c4f026"><span class="section-number-3">11.2</span> Create a Wrapper Cookbook</h3>
<div class="outline-text-3" id="text-11-2">
<p>
A "wrapper cookbook" references other cookbooks as libraries, and use them with custom attributes.
</p>

<p>
Generate a new cookbook:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">cd</span> chef-repo/cookbooks
chef generate cookbook myhaproxy
</pre>
</div>

<p>
Add <code>haproxy</code> cookbook as dependency:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 21: </span><code>chef-repo/cookbooks/myhaproxy/metadata.rb</code></label><pre class="src src-ruby">depends <span class="org-string">'haproxy'</span>, <span class="org-string">'~&gt; 7.1.0'</span>
</pre>
</div>

<p>
<code>haproxy</code> provides <a href="https://github.com/sous-chefs/haproxy/tree/master/test/fixtures/cookbooks/test/recipes">example recipes</a> to get started with. Copy the recipe <code>config_array.rb</code> to the cookbook (but remove the unneeded parts):
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 22: </span><code>chef-repo/cookbooks/myhaproxy/recipes/default.rb</code></label><pre class="src src-ruby">haproxy_install <span class="org-string">'package'</span>

haproxy_frontend <span class="org-string">'http-in'</span> <span class="org-keyword">do</span>
  bind <span class="org-string">'*:80'</span>
  default_backend <span class="org-string">'servers'</span>
<span class="org-keyword">end</span>

haproxy_backend <span class="org-string">'servers'</span> <span class="org-keyword">do</span>
  server [
    <span class="org-string">'server1 127.0.0.1:8000 maxconn 32'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">IP and port will be updated later</span>
  ]
<span class="org-keyword">end</span>

haproxy_service <span class="org-string">'haproxy'</span> <span class="org-keyword">do</span>
  <span class="org-comment-delimiter"># </span><span class="org-comment">Whenever haproxy_backend is updated, e.g. adding a new node, we need to</span>
  <span class="org-comment-delimiter"># </span><span class="org-comment">reload haproxy service. Subscribe to the template resouce that</span>
  <span class="org-comment-delimiter"># </span><span class="org-comment">haproxy_backend uses and reload whenever it's updated.</span>
  subscribes <span class="org-constant">:reload</span>, <span class="org-string">'template[/etc/haproxy/haproxy.cfg]'</span>, <span class="org-constant">:immediately</span>
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>
