programming/course/chef_fundamentals.org
** Add Web Server Members

Confirm node =web1= IP address:

#+begin_src sh
$ knife node show web1
IP: 192.168.10.43 # As defined in Vagrantfile
#+end_src 

Update IP address in the =haproxy= recipe:

#+CAPTION: =chef-repo/cookbooks/myhaproxy/recipes/default.rb=
#+begin_src ruby
haproxy_backend 'servers' do
  server [
    'server1 192.168.10.43:80 maxconn 32'
  ]
end
#+end_src

** Manage Cookbooks with Berkshelf

While a cookbook depends on a community cookbook, the community cookbook may also depends on other cookbooks, in which situation it would be difficult to manage the dependencies. Berkshelf is a dependency manager for Chef cookbooks.

Install the dependencies and confirm the result:

#+begin_src sh
$ cd chef-repo/cookbooks/myhaproxy
$ berks install
$ ls ~/.berkshelf/cookbooks
haproxy-7.1.0 ...
#+end_src

Upload the dependencies to Chef Server and confirm the result:

#+begin_src sh
$ berks upload
$ knife cookbook list
haproxy   7.1.0
...
#+end_src

** Bootstrap Load Balancer

Similar steps as bootstraping a web server, but the run list can be specified with =knife bootstrop= command, instead of adding the run list manually and run Chef Client to converge the resources.

Get SSH config of the Vagrant nodes:

#+begin_src sh
$ vagrant ssh-config
Host load-balancer
  User vagrant
  Port <port> # To be used in "knife bootstrap" command
  IdentityFile <path_to_id_file> # To be used in "knife bootstrap" command
#+end_src

Bootstrap the node with SSH config and run list, and confirm the result:

#+begin_src sh
$ knife bootstrap localhost -N load-balancer -p <port> -x vagrant -i <path_to_id_file> -r 'recipe[myhaproxy]' --sudo
Chef Client finished, 16/29 resources updated ...
$ knife node list
$ knife node show load-balancer
Run List: recipe[myhaproxy]
#+end_src

Login to the Vagrant node and confirm the load balancer is working:

#+begin_src sh
$ vagrant ssh load-balancer
> curl localhost
... # The HTML output from web server nodes
> sudo service haproxy restart # Somehow it didn't work in the beginning but restarting the service fixed it
#+end_src

Confirm the result by browsing to the load balancer's forwarded port https://http://localhost:9000/ from the host machine.

* Manage Nodes
** Run chef-client on a Schedule

The community cookbook [[https://supermarket.chef.io/cookbooks/chef-client][chef-client]] can be used to configure the node to run Chef Client periodically.

Generate a wrapper cookbook:

#+begin_src sh
cd chef-repo
chef generate cookbook cookbooks/mychefclient
#+end_src

Add =chef-client= as dependency:

#+CAPTION: =chef-repo/cookbooks/mychefclient/metadata.rb=
#+begin_src ruby
depends 'chef-client', '~> 11.2.0'
#+end_src

Update default recipe to run Chef Client periodically:

#+CAPTION: =chef-repo/cookbooks/mychefclient/recipes/default.rb=
#+begin_src ruby
node.default['chef_client']['interval'] = '300' # Run every 300 seconds
node.default['chef_client']['splay'] = '60'     # Random delay of 0-60 seconds before running Chef Client
                                                # To avoid updating all nodes at the same time

include_recipe 'chef-client::default'
#+end_src

Install and upload the dependency:

#+begin_src sh
cd chef-repo/cookbooks/mychefclient
berks install
berks upload
#+end_src

Add the recipe to the run list of the load balancer node, and run Chef Client on it:

#+begin_src sh
cd chef-reop
knife node run_list add load-balancer 'recipe[mychefclient]'
vagrant ssh load-balancer
sudo chef-client
#+end_src
* Roles
** Create and Assign Roles

Create a role file:

#+CAPTION: =chef-repo/roles/web.rb=
#+begin_src ruby
name 'web'
description 'web server'
run_list 'recipe[workstation]','recipe[apache]'
default_attributes 'apache-test' => {
  'attribute_1' => 'this is attribute 1',
  'attribute_2' => 'this is attribute 2'
}
#+end_src

Upload the role to Chef Server:

#+begin_src sh
$ knife role from file roles/web.rb
#+end_src

Set the role to node's run list and apply the role:

#+begin_src sh
$ knife node run_list set web1 "role[web]"
$ knife node show web1
Run Lists: role[web] # Role is set to the run list
Roles:               # No role yet, the role will be converged when Chef Client runs on the node
$ vagrant ssh web1
> sudo chef-client
$ knife node show web1
Run Lists: role[web]
Roles:     web       # Role is applied
#+end_src

** Converge Using the =knife ssh= Command

=knife ssh= command can be used to SSH connect to the nodes and run commands:

#+begin_src sh
$ vagrant ssh-config # Get the SSH params
User vagrant
Port <port>
IdentityFile <path>
$ knife ssh localhost "sudo chef-client" --manual-list -p <port> -x vagrant -i <path>
#+end_src

* Search
** Explore Chef Server Indices

Chef Server maintains (in a PostgreSQL database) a searchable index of all nodes with the infrastructure. =knife search= command can be used to search through these indices.

