programming/course/chef_fundamentals.html

<div id="outline-container-org6557567" class="outline-3">
<h3 id="org6557567"><span class="section-number-3">11.3</span> Add Web Server Members</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Confirm node <code>web1</code> IP address:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife node show web1
IP: 192.168.10.43 <span class="org-comment-delimiter"># </span><span class="org-comment">As defined in Vagrantfile</span>
</pre>
</div>

<p>
Update IP address in the <code>haproxy</code> recipe:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 23: </span><code>chef-repo/cookbooks/myhaproxy/recipes/default.rb</code></label><pre class="src src-ruby">haproxy_backend <span class="org-string">'servers'</span> <span class="org-keyword">do</span>
  server [
    <span class="org-string">'server1 192.168.10.43:80 maxconn 32'</span>
  ]
<span class="org-keyword">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7644e3e" class="outline-3">
<h3 id="org7644e3e"><span class="section-number-3">11.4</span> Manage Cookbooks with Berkshelf</h3>
<div class="outline-text-3" id="text-11-4">
<p>
While a cookbook depends on a community cookbook, the community cookbook may also depends on other cookbooks, in which situation it would be difficult to manage the dependencies. Berkshelf is a dependency manager for Chef cookbooks.
</p>

<p>
Install the dependencies and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cd chef-repo/cookbooks/myhaproxy
$ berks install
$ ls ~/.berkshelf/cookbooks
haproxy-7.1.0 ...
</pre>
</div>

<p>
Upload the dependencies to Chef Server and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ berks upload
$ knife cookbook list
haproxy   7.1.0
...
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a364e9" class="outline-3">
<h3 id="org0a364e9"><span class="section-number-3">11.5</span> Bootstrap Load Balancer</h3>
<div class="outline-text-3" id="text-11-5">
<p>
Similar steps as bootstraping a web server, but the run list can be specified with <code>knife bootstrop</code> command, instead of adding the run list manually and run Chef Client to converge the resources.
</p>

<p>
Get SSH config of the Vagrant nodes:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ vagrant ssh-config
Host load-balancer
  User vagrant
  Port &lt;port&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">To be used in "knife bootstrap" command</span>
  IdentityFile &lt;path_to_id_file&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">To be used in "knife bootstrap" command</span>
</pre>
</div>

<p>
Bootstrap the node with SSH config and run list, and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife bootstrap localhost -N load-balancer -p &lt;port&gt; -x vagrant -i &lt;path_to_id_file&gt; -r <span class="org-string">'recipe[myhaproxy]'</span> --sudo
Chef Client finished, 16/29 resources updated ...
$ knife node list
$ knife node show load-balancer
Run List: recipe[myhaproxy]
</pre>
</div>

<p>
Login to the Vagrant node and confirm the load balancer is working:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ vagrant ssh load-balancer
&gt; curl localhost
... <span class="org-comment-delimiter"># </span><span class="org-comment">The HTML output from web server nodes</span>
&gt; sudo service haproxy restart <span class="org-comment-delimiter"># </span><span class="org-comment">Somehow it didn't work in the beginning but restarting the service fixed it</span>
</pre>
</div>

<p>
Confirm the result by browsing to the load balancer's forwarded port <a href="https://http//localhost:9000/">https://http//localhost:9000/</a> from the host machine.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc732050" class="outline-2">
<h2 id="orgc732050"><span class="section-number-2">12</span> Manage Nodes</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-org57dd0e0" class="outline-3">
<h3 id="org57dd0e0"><span class="section-number-3">12.1</span> Run chef-client on a Schedule</h3>
<div class="outline-text-3" id="text-12-1">
<p>
The community cookbook <a href="https://supermarket.chef.io/cookbooks/chef-client">chef-client</a> can be used to configure the node to run Chef Client periodically.
</p>

<p>
Generate a wrapper cookbook:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">cd</span> chef-repo
chef generate cookbook cookbooks/mychefclient
</pre>
</div>

<p>
Add <code>chef-client</code> as dependency:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 24: </span><code>chef-repo/cookbooks/mychefclient/metadata.rb</code></label><pre class="src src-ruby">depends <span class="org-string">'chef-client'</span>, <span class="org-string">'~&gt; 11.2.0'</span>
</pre>
</div>

<p>
Update default recipe to run Chef Client periodically:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 25: </span><code>chef-repo/cookbooks/mychefclient/recipes/default.rb</code></label><pre class="src src-ruby">node.default[<span class="org-string">'chef_client'</span>][<span class="org-string">'interval'</span>] = <span class="org-string">'300'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">Run every 300 seconds</span>
node.default[<span class="org-string">'chef_client'</span>][<span class="org-string">'splay'</span>] = <span class="org-string">'60'</span>     <span class="org-comment-delimiter"># </span><span class="org-comment">Random delay of 0-60 seconds before running Chef Client</span>
                                                <span class="org-comment-delimiter"># </span><span class="org-comment">To avoid updating all nodes at the same time</span>

include_recipe <span class="org-string">'chef-client::default'</span>
</pre>
</div>

<p>
Install and upload the dependency:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">cd</span> chef-repo/cookbooks/mychefclient
berks install
berks upload
</pre>
</div>

<p>
Add the recipe to the run list of the load balancer node, and run Chef Client on it:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">cd</span> chef-reop
knife node run_list add load-balancer <span class="org-string">'recipe[mychefclient]'</span>
vagrant ssh load-balancer
sudo chef-client
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2b587d1" class="outline-2">
<h2 id="org2b587d1"><span class="section-number-2">13</span> Roles</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-orgdadb895" class="outline-3">
<h3 id="orgdadb895"><span class="section-number-3">13.1</span> Create and Assign Roles</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Create a role file:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 26: </span><code>chef-repo/roles/web.rb</code></label><pre class="src src-ruby">name <span class="org-string">'web'</span>
description <span class="org-string">'web server'</span>
run_list <span class="org-string">'recipe[workstation]'</span>,<span class="org-string">'recipe[apache]'</span>
default_attributes <span class="org-string">'apache-test'</span> =&gt; {
  <span class="org-string">'attribute_1'</span> =&gt; <span class="org-string">'this is attribute 1'</span>,
  <span class="org-string">'attribute_2'</span> =&gt; <span class="org-string">'this is attribute 2'</span>
}
</pre>
</div>

<p>
Upload the role to Chef Server:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife role from file roles/web.rb
</pre>
</div>

<p>
Set the role to node's run list and apply the role:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife node run_list set web1 <span class="org-string">"role[web]"</span>
$ knife node show web1
Run Lists: role[web] <span class="org-comment-delimiter"># </span><span class="org-comment">Role is set to the run list</span>
Roles:               <span class="org-comment-delimiter"># </span><span class="org-comment">No role yet, the role will be converged when Chef Client runs on the node</span>
$ vagrant ssh web1
&gt; sudo chef-client
$ knife node show web1
Run Lists: role[web]
Roles:     web       <span class="org-comment-delimiter"># </span><span class="org-comment">Role is applied</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org74e0017" class="outline-3">
<h3 id="org74e0017"><span class="section-number-3">13.2</span> Converge Using the <code>knife ssh</code> Command</h3>
<div class="outline-text-3" id="text-13-2">
<p>
<code>knife ssh</code> command can be used to SSH connect to the nodes and run commands:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ vagrant ssh-config <span class="org-comment-delimiter"># </span><span class="org-comment">Get the SSH params</span>
User vagrant
Port &lt;port&gt;
IdentityFile &lt;path&gt;
$ knife ssh localhost <span class="org-string">"sudo chef-client"</span> --manual-list -p &lt;port&gt; -x vagrant -i &lt;path&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org995d167" class="outline-2">
<h2 id="org995d167"><span class="section-number-2">14</span> Search</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-org5d9a0a5" class="outline-3">
<h3 id="org5d9a0a5"><span class="section-number-3">14.1</span> Explore Chef Server Indices</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Chef Server maintains (in a PostgreSQL database) a searchable index of all nodes with the infrastructure. <code>knife search</code> command can be used to search through these indices.
</p>
</div>
</div>
