programming/course/chef_fundamentals.org
** Run Searches with Knife

#+begin_src sh
$ knife search node "*:*"         # All nodes
$ knife search node "name:*"      # Nodes with any name
$ knife search node "name:web?"   # Nodes with names of "web" followed by a character
$ knife search node "*:*" -a name # Names of all nodes
$ knife search node "role:web AND recipes:apache" # Nodes with role "web" and recipe "apache"
#+end_src

** Refactor for Dynamic Load Balancing

Previously the =haproxy= load balancer was configures with hard-coded web nodes. By using Chef Server's search indices, the load balancer can be configures to query and update the web nodes automatically.

#+CAPTION: =chef-repo/cookbooks/myhaproxy/recipes/default.rb=
#+begin_src ruby
# The hard-coded server list
# haproxy_backend 'servers' do
#   server [
#     'server1 192.168.10.43:80 maxconn 32',
#     'server2 192.168.10.44:80 maxconn 32',
#   ]
# end

web_nodes = search('node', 'role:web') # Returns the same result as "knife search" command
servers = []

web_nodes.each do |web_node|
  server = "#{web_node['hostname']} #{web_node['ipaddress']}:80 maxconn 32"
  servers.push(server)
end

haproxy_backend 'servers' do
  server servers
end
#+end_src

If the infrastructure is hosted on a cloud provider, the host name and IP attributes to use will be different, namely =node['cloud']['public_hostname']= and =node['cloud']['public_ipv4']=.

* Environments
** Create and Manage a Production Environment

All nodes belong to the =_default= environment by default:

#+begin_src sh
$ knife search node '*:*'
Environment: _default
#+end_src

Create a new environment file:

#+CAPTION: =chef-repo/environments/production.rb=
#+begin_src ruby
name 'production'
description 'Production environment'
cookbook 'apache', '= 0.1.1' # To match the actual current version of the cookbook
cookbook 'myhaproxy', '= 0.2.0' # To match the actual current version of the cookbook
#+end_src

Upload the environment to Chef Server, and confirm the result:

#+begin_src sh
$ knife environment from file environments/production.rb
$ knife environment list
$ knife environment show production
#+end_src

Set one node to production environment, and confirm the result:

#+begin_src sh
$ knife node environment set web1 production
$ knife node show web1
#+end_src

By setting the node to the environment, only Chef Server knows about it, the node itself won't be aware of the change until Chef Client runs on the node. 

** Refine the Load Balancer

The load balancer cookbook needs to be updated to avoid routing traffic to web nodes of different environments:

#+CAPTION: =chef-repo/cookbooks/myhaproxy/recipes/default.rb=
#+begin_src ruby
web_nodes = search('node', 'role:web')
# Update to:
web_nodes = search('node', "role:web AND chef_environment:#{node.chef_environment}")
#+end_src

Note that after incrementing =myhaproxy= cookbook's version following the above change, the cookbook version restrictions of the load balancer node's environment need to be updated too, otherwise this latest version of cookbook won't be used on the node.

* Data Bags
** What's in the Bag?

A data bag is a collection of data that is relevant to and can be accessed by multiple nodes, such as user accounts and passwords, to avoid duplicating these info for each node.

** Create and Manage Data Bags

Create data bags for users and groups data, and confirm the result:

#+begin_src sh
$ knife data bag create users
$ knife data bag create groups
$ knife data bag list
#+end_src

Create JSON files for data bag items:

#+CAPTION: =chef-repo/databags/users/user1.json=
#+begin_src js
{
  "id": "user1",
  "comment": "This is user 1",
  "uid": "100",
  "gid": "1",
  "home": "/home/user1",
  "shell": "/bin/bash",
  "platform": "centos"
}
#+end_src

#+CAPTION: =chef-repo/databags/groups/group1.json=
#+begin_src js
{
  "id": "group1",
  "gid": "1",
  "members": ["user1"]
}
#+end_src

Add the items to the data bag, and confirm the result:

#+begin_src sh
$ knife data bag from file users databags/users/user1.json
$ knife data bag from file groups databags/groups/group1.json
$ knife data bag show users
$ knife data bag show groups
#+end_src

Data bags are indexed by Chef, so it's available for search:

#+begin_src sh
$ knife search users "*:*"
$ knife search users "platform:centos"
$ knife search users "platform:centos" -a comment
#+end_src

