programming/course/chef_fundamentals.html

<div id="outline-container-orgd785c4b" class="outline-3">
<h3 id="orgd785c4b"><span class="section-number-3">14.2</span> Run Searches with Knife</h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">
<pre class="src src-sh">$ knife search node <span class="org-string">"*:*"</span>         <span class="org-comment-delimiter"># </span><span class="org-comment">All nodes</span>
$ knife search node <span class="org-string">"name:*"</span>      <span class="org-comment-delimiter"># </span><span class="org-comment">Nodes with any name</span>
$ knife search node <span class="org-string">"name:web?"</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">Nodes with names of "web" followed by a character</span>
$ knife search node <span class="org-string">"*:*"</span> -a name <span class="org-comment-delimiter"># </span><span class="org-comment">Names of all nodes</span>
$ knife search node <span class="org-string">"role:web AND recipes:apache"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">Nodes with role "web" and recipe "apache"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb57a47" class="outline-3">
<h3 id="orgdb57a47"><span class="section-number-3">14.3</span> Refactor for Dynamic Load Balancing</h3>
<div class="outline-text-3" id="text-14-3">
<p>
Previously the <code>haproxy</code> load balancer was configures with hard-coded web nodes. By using Chef Server's search indices, the load balancer can be configures to query and update the web nodes automatically.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 27: </span><code>chef-repo/cookbooks/myhaproxy/recipes/default.rb</code></label><pre class="src src-ruby"><span class="org-comment-delimiter"># </span><span class="org-comment">The hard-coded server list</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">haproxy_backend 'servers' do</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">server [</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">'server1 192.168.10.43:80 maxconn 32',</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">'server2 192.168.10.44:80 maxconn 32',</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">end</span>

web_nodes = search(<span class="org-string">'node'</span>, <span class="org-string">'role:web'</span>) <span class="org-comment-delimiter"># </span><span class="org-comment">Returns the same result as "knife search" command</span>
servers = []

web_nodes.each <span class="org-keyword">do</span> |web_node|
  server = <span class="org-string">"</span><span class="org-variable-name">#{web_node['hostname']}</span><span class="org-string"> </span><span class="org-variable-name">#{web_node['ipaddress']}</span><span class="org-string">:80 maxconn 32"</span>
  servers.push(server)
<span class="org-keyword">end</span>

haproxy_backend <span class="org-string">'servers'</span> <span class="org-keyword">do</span>
  server servers
<span class="org-keyword">end</span>
</pre>
</div>

<p>
If the infrastructure is hosted on a cloud provider, the host name and IP attributes to use will be different, namely <code>node['cloud']['public_hostname']</code> and <code>node['cloud']['public_ipv4']</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgeb976e0" class="outline-2">
<h2 id="orgeb976e0"><span class="section-number-2">15</span> Environments</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-org0331aef" class="outline-3">
<h3 id="org0331aef"><span class="section-number-3">15.1</span> Create and Manage a Production Environment</h3>
<div class="outline-text-3" id="text-15-1">
<p>
All nodes belong to the <code>_default</code> environment by default:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife search node <span class="org-string">'*:*'</span>
Environment: _default
</pre>
</div>

<p>
Create a new environment file:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 28: </span><code>chef-repo/environments/production.rb</code></label><pre class="src src-ruby">name <span class="org-string">'production'</span>
description <span class="org-string">'Production environment'</span>
cookbook <span class="org-string">'apache'</span>, <span class="org-string">'= 0.1.1'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">To match the actual current version of the cookbook</span>
cookbook <span class="org-string">'myhaproxy'</span>, <span class="org-string">'= 0.2.0'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">To match the actual current version of the cookbook</span>
</pre>
</div>

<p>
Upload the environment to Chef Server, and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife environment from file environments/production.rb
$ knife environment list
$ knife environment show production
</pre>
</div>

<p>
Set one node to production environment, and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife node environment set web1 production
$ knife node show web1
</pre>
</div>

<p>
By setting the node to the environment, only Chef Server knows about it, the node itself won't be aware of the change until Chef Client runs on the node. 
</p>
</div>
</div>

<div id="outline-container-org77751c4" class="outline-3">
<h3 id="org77751c4"><span class="section-number-3">15.2</span> Refine the Load Balancer</h3>
<div class="outline-text-3" id="text-15-2">
<p>
The load balancer cookbook needs to be updated to avoid routing traffic to web nodes of different environments:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 29: </span><code>chef-repo/cookbooks/myhaproxy/recipes/default.rb</code></label><pre class="src src-ruby">web_nodes = search(<span class="org-string">'node'</span>, <span class="org-string">'role:web'</span>)
<span class="org-comment-delimiter"># </span><span class="org-comment">Update to:</span>
web_nodes = search(<span class="org-string">'node'</span>, <span class="org-string">"role:web AND chef_environment:</span><span class="org-variable-name">#{node.chef_environment}</span><span class="org-string">"</span>)
</pre>
</div>

<p>
Note that after incrementing <code>myhaproxy</code> cookbook's version following the above change, the cookbook version restrictions of the load balancer node's environment need to be updated too, otherwise this latest version of cookbook won't be used on the node.
</p>
</div>
</div>
</div>

<div id="outline-container-org3d6d03c" class="outline-2">
<h2 id="org3d6d03c"><span class="section-number-2">16</span> Data Bags</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-orgbffba4a" class="outline-3">
<h3 id="orgbffba4a"><span class="section-number-3">16.1</span> What's in the Bag?</h3>
<div class="outline-text-3" id="text-16-1">
<p>
A data bag is a collection of data that is relevant to and can be accessed by multiple nodes, such as user accounts and passwords, to avoid duplicating these info for each node.
</p>
</div>
</div>

<div id="outline-container-org1f89857" class="outline-3">
<h3 id="org1f89857"><span class="section-number-3">16.2</span> Create and Manage Data Bags</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Create data bags for users and groups data, and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife data bag create users
$ knife data bag create groups
$ knife data bag list
</pre>
</div>

<p>
Create JSON files for data bag items:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 30: </span><code>chef-repo/databags/users/user1.json</code></label><pre class="src src-js">{
  <span class="org-string">"id"</span>: <span class="org-string">"user1"</span>,
  <span class="org-string">"comment"</span>: <span class="org-string">"This is user 1"</span>,
  <span class="org-string">"uid"</span>: <span class="org-string">"100"</span>,
  <span class="org-string">"gid"</span>: <span class="org-string">"1"</span>,
  <span class="org-string">"home"</span>: <span class="org-string">"/home/user1"</span>,
  <span class="org-string">"shell"</span>: <span class="org-string">"/bin/bash"</span>,
  <span class="org-string">"platform"</span>: <span class="org-string">"centos"</span>
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 31: </span><code>chef-repo/databags/groups/group1.json</code></label><pre class="src src-js">{
  <span class="org-string">"id"</span>: <span class="org-string">"group1"</span>,
  <span class="org-string">"gid"</span>: <span class="org-string">"1"</span>,
  <span class="org-string">"members"</span>: [<span class="org-string">"user1"</span>]
}
</pre>
</div>

<p>
Add the items to the data bag, and confirm the result:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife data bag from file users databags/users/user1.json
$ knife data bag from file groups databags/groups/group1.json
$ knife data bag show users
$ knife data bag show groups
</pre>
</div>

<p>
Data bags are indexed by Chef, so it's available for search:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife search users <span class="org-string">"*:*"</span>
$ knife search users <span class="org-string">"platform:centos"</span>
$ knife search users <span class="org-string">"platform:centos"</span> -a comment
</pre>
</div>
</div>
</div>
