programming/course/chef_fundamentals.org
** Dynamic Search and Find

Create a cookbook to use the data bag to create users:

#+begin_src sh
$ chef generate cookbook cookbooks/users
#+end_src

#+CAPTION: =chef-repo/cookbooks/users/recipes/default.rb=
#+begin_src ruby
search('users', 'platform:centos').each do |user_data|
  user user_data['id'] do
    comment user_data['comment']
    uid user_data['uid']
    gid user_data['gid']
    home user_data['home']
    shell user_data['shell']
  end
end
#+end_src

Update the role file:

#+CAPTION: =chef-repo/roles/web.rb=
#+begin_src ruby
run_list 'recipe[users]','recipe[workstation]','recipe[apache]'
#+end_src

Upload the cookbook and update the role on Chef Server:

#+begin_src sh
$ knife cookbook upload users
$ knife role from file roles/web.rb
#+end_src

Converge the web node and confirm the user is created by Chef:

#+begin_src sh
$ vagrant ssh web1
> sudo chef-client
> grep "user1" /etc/passwd
user1:x:1001:1001::/home/user1:/bin/bash
#+end_src

** Encrypt Secrets

Data bags can be encrypted to protected sensitive information such as passwords. Create a secret key and an encrypted data bag, and upload an encrypted data bag item to it:

#+begin_src sh
$ openssl rand -base64 512 > secret_key
$ knife data bag create secret_users --secret-file secret_key
$ knife data bag from file secret_users databags/users/user1.json --secret-file secret_key
#+end_src

Confirm the data bag item is encrypted, and can be decrypted by using the secret key:

#+begin_src sh
$ knife data bag show secret_users user1
# Encrypted data
$ knife data bag show secret_users user1 --secret-file secret_key
# Decrypted data
#+end_src
