programming/course/chef_fundamentals.html

<div id="outline-container-org7ea1ee5" class="outline-3">
<h3 id="org7ea1ee5"><span class="section-number-3">16.3</span> Dynamic Search and Find</h3>
<div class="outline-text-3" id="text-16-3">
<p>
Create a cookbook to use the data bag to create users:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ chef generate cookbook cookbooks/users
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 32: </span><code>chef-repo/cookbooks/users/recipes/default.rb</code></label><pre class="src src-ruby">search(<span class="org-string">'users'</span>, <span class="org-string">'platform:centos'</span>).each <span class="org-keyword">do</span> |user_data|
  user user_data[<span class="org-string">'id'</span>] <span class="org-keyword">do</span>
    comment user_data[<span class="org-string">'comment'</span>]
    uid user_data[<span class="org-string">'uid'</span>]
    gid user_data[<span class="org-string">'gid'</span>]
    home user_data[<span class="org-string">'home'</span>]
    shell user_data[<span class="org-string">'shell'</span>]
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Update the role file:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 33: </span><code>chef-repo/roles/web.rb</code></label><pre class="src src-ruby">run_list <span class="org-string">'recipe[users]'</span>,<span class="org-string">'recipe[workstation]'</span>,<span class="org-string">'recipe[apache]'</span>
</pre>
</div>

<p>
Upload the cookbook and update the role on Chef Server:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife cookbook upload users
$ knife role from file roles/web.rb
</pre>
</div>

<p>
Converge the web node and confirm the user is created by Chef:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ vagrant ssh web1
&gt; sudo chef-client
&gt; grep <span class="org-string">"user1"</span> /etc/passwd
user1:x:1001:1001::/home/user1:/bin/bash
</pre>
</div>
</div>
</div>

<div id="outline-container-org56e461f" class="outline-3">
<h3 id="org56e461f"><span class="section-number-3">16.4</span> Encrypt Secrets</h3>
<div class="outline-text-3" id="text-16-4">
<p>
Data bags can be encrypted to protected sensitive information such as passwords. Create a secret key and an encrypted data bag, and upload an encrypted data bag item to it:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ openssl rand -base64 512 &gt; secret_key
$ knife data bag create secret_users --secret-file secret_key
$ knife data bag from file secret_users databags/users/user1.json --secret-file secret_key
</pre>
</div>

<p>
Confirm the data bag item is encrypted, and can be decrypted by using the secret key:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ knife data bag show secret_users user1
<span class="org-comment-delimiter"># </span><span class="org-comment">Encrypted data</span>
$ knife data bag show secret_users user1 --secret-file secret_key
<span class="org-comment-delimiter"># </span><span class="org-comment">Decrypted data</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2019-06-16 Sun 19:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
